In [3]:
import pandas as pd

In [5]:
s = pd.Series([10,30,50,40,60],index=['a','b','c','d','e'])
s

a    10
b    30
c    50
d    40
e    60
dtype: int64

##### Creating a Series using Dist

In [18]:
data = pd.Series({"name":"Husen","usn":"786"})
data.shape

(2,)

In [32]:
s = pd.Series([10,30,50,40,60,None],index=['a','b','c','d','e','f'])
s.isnull()

a    False
b    False
c    False
d    False
e    False
f     True
dtype: bool

In [37]:

print(s[['e','f']])
print(s['f'])

e    60.0
f     NaN
dtype: float64
nan

#### Creating a DataFrames

##### 1.Using a Dictionary

In [40]:
from pandas import DataFrame


data = {
    "Name":["aaa","bbb","ccc","ddd"],
    "usn":[10,20,30,40],
    "age":[18,66,32,42]
}
df = pd.DataFrame(data)
df

  Name  usn  age
0  aaa   10   18
1  bbb   20   66
2  ccc   30   32
3  ddd   40   42

#### 2. Using a List

In [44]:
data = [
    ["AAA",10,45],
    ["BBB",20,22],
    ["CCC",30,23]
]
df = pd.DataFrame(data,columns=["Name","usn","age"])
df

  Name  usn  age
0  AAA   10   45
1  BBB   20   22
2  CCC   30   23

In [46]:
import pandas as pd

df = pd.DataFrame({
    "Name": ["Husen", "Ali", "Sara", "Ayaan"],
    "Age": [22, 23, 21, 24]
}, index=[101, 102, 103, 104])
df

      Name  Age
101  Husen   22
102    Ali   23
103   Sara   21
104  Ayaan   24

In [49]:
df.loc[101]                    # Row with index label 101

Name    Husen
Age        22
Name: 101, dtype: object

In [50]:
df.loc[101, "Name"]            # Husen

'Husen'

In [51]:
df.loc[101:103, ["Name","Age"]]  # Inclusive slicing

      Name  Age
101  Husen   22
102    Ali   23
103   Sara   21

In [52]:
df.iloc[0:3, 0:2]

      Name  Age
101  Husen   22
102    Ali   23
103   Sara   21